{"keywords":[],"dates":[],"name":"Matan Rahav","email":"rahavmatan@gmail.com","phone":"525784537","summary":"Always looking for new and simpler solutions to bigger and more challenging problems.\nFluent in English and Hebrew.\nPerforms well under pressure.\nA team player, but not hesitant to take initiative.","skills":"Javascript (es5 / 6+ ) HTML / CSS\nNodejs + express + Nginx Typescript\nMongodb javascript tooling: Webpack, Parcel,\nBabel, Gulp\nReact + Redux / Angular 1 , 2+ RabbitMQ\nIonic framework Basic knowledge in: Docker,\nKubernetes, C#, .Net, SQL\nAWS - (ec2 / lambda / api gateway /\nelb / cloudwatch)\nLoad testing with Apache AB /\nAutocannon\nGit / TFS","experience":"DXC technology \" Frontend developer \" 10/18 – present\n- Working as a Frontend developer on the Israeli Rail project.\n- Implementing (and occasionally designing) the UI using Angular 2+ according to\nspecifications from the client.\n- Supplying the infrastructure and services to be used by the entire team. Resulting in\nhigher code reusability, and overall cleaner code.\n- Working on a mobile app using Ionic.\nGivo mobile \" Fullstack developer \" 7/17 – 9/18\n- Worked as a Fullstack developer, and was involved in many aspects of the startup,\nworking closely with the CEO, product manager and designer .\n- Oversaw the application lifecycle: design , code, deployment, logging and\nmonitoring.\n- Scaling and load testing. A maximum load of 7000+ requests per minute was\nachieved using horizontal scaling and in-memory caching.\n- Developed a coupons and discounts solution that integrated with Shopify's API.\n- Helped design the company's core algorithms and business logic.\n- Built and maintained the API and microservices in Nodejs and Mongodb.\nMicroservice communication was accomplished using RabbitMQ. some\nmicroservices had scheduled cron jobs.\n- Integrated with popular API's (google, facebook, shopify, stripe, cloudinary etc).\n- Built the company's dashboard using React + Redux.\n- Built the company's chat addon for Shopify using React from mockups and\nwireframes.\nIndependent work Abroad and in Israel \" Musical director / guitar player \" 2010 -\n2016\n- Conduncting, managing and playing in lounge bands, show band and party bands\nwith leading international cruise lines (Carnival, HAL)\n- Teaching music, guitar, ensamble in conservatories and privately\n- performing and recording with local musicians in israel","education":"Hyperactive 8/16 – 6/17\nGot accepted into the 'Talipot' program at Hyperactive under the guidance of Tal Shachor,\nspecializing in fullstack development .\nThe program covers the basics of programing, OOP in depth, solo and team projects, and\nmore.\nThe tuition for the program is free, and when graduating, the graduates work for the\ncompany or its clients.\nRimon school of music 2007-2010\njazz performance program"}